grpc_server.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-11 Sat 10:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>golang版本grpc服务端浅析</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">golang版本grpc服务端浅析</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6d7fb19">1. 前言</a></li>
<li><a href="#orgf197dd2">2. 注册流程</a></li>
<li><a href="#org042b16d">3. 调用流程</a></li>
<li><a href="#org1662978">4. 总结</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6d7fb19" class="outline-2">
<h2 id="org6d7fb19"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
前面分析完了客户端，在经过一段时间的颓废后，我觉得我至少应该做到有始有终，所以今天写写服务的流程.
</p>
</div>
</div>
