org/grpc_server.org
* 注册流程
  想象一个rpc的流程, 客户端指明一个函数的函数名跟参数，服务端找到这个函数，然后把参数应用到这个函数上。所以一个注册服务流程，就是告诉grpc让收到一个rpc调用的时候，如何找到我们的函数。看一个最简单的服务端程序.
  #+BEGIN_SRC go
    type server struct{}
    func (s *server) SayHello(ctx context.Context, in *pb.HelloRequest) (*pb.HelloReply, error) {
  	  return &pb.HelloReply{Message: "Hello " + in.Name}, nil
    }
    func main() {
  	  lis, err := net.Listen("tcp", port)
  	  if err != nil {
  		  log.Fatalf("failed to listen: %v", err)
  	  }
  	  s := grpc.NewServer()
  	  pb.RegisterGreeterServer(s, &server{})
  	  reflection.Register(s)
  	  if err := s.Serve(lis); err != nil {
  		  log.Fatalf("failed to serve: %v", err)
  	  }
    }
  #+END_SRC
  一般的流程是先定义个proto文件，然后根据protoc工具生成go的grpc代码，这里的SayHello函数是你proto文件中声明的函数。然后你实现你声明的接口，然后再注册到server中，就可以供客户端调用了。
  在grpc注册的过程中有几个概念:
  1. Server
  2. grpc Service
  3. ServiceDesc
  4. 自己的service
  自己的service很简单，就是上面的server结构体，这个结构实现了相应的interface。servicedesc相当于是一个根据proto文件来描述你server需要实现的功能的结构。grpc service, 你proto文件可能会声明多个service，你的Server也可以注册多个service。Server 原则上来说只需要一个server，一个server下有多个service，一个service下有多个方法。
  我们看下RegisterGreeterServer这个方法
  #+BEGIN_SRC go
    //描述一个service具有哪些方法
    var _Greeter_serviceDesc = grpc.ServiceDesc{
      ServiceName: "helloworld.Greeter",
      HandlerType: (*GreeterServer)(nil),
      Methods: []grpc.MethodDesc{
    	  {
    		  MethodName: "SayHello",
    		  Handler:    _Greeter_SayHello_Handler,
    	  },
      },
      Streams:  []grpc.StreamDesc{},
      Metadata: "helloworld.proto",
    }
    func RegisterGreeterServer(s *grpc.Server, srv GreeterServer) {
      s.RegisterService(&_Greeter_serviceDesc, srv)
    }
    func (s *Server) RegisterService(sd *ServiceDesc, ss interface{}) {
  	  ht := reflect.TypeOf(sd.HandlerType).Elem()
  	  st := reflect.TypeOf(ss)
  	  //判断是否实现相应的接口
  	  if !st.Implements(ht) {
  		  grpclog.Fatalf("grpc: Server.RegisterService found the handler of type %v that does not satisfy %v", st, ht)
  	  }
  	  s.register(sd, ss)
    }
    func (s *Server) register(sd *ServiceDesc, ss interface{}) {
  	  s.mu.Lock()
  	  defer s.mu.Unlock()
  	  s.printf("RegisterService(%q)", sd.ServiceName)
  	  if _, ok := s.m[sd.ServiceName]; ok {
  		  grpclog.Fatalf("grpc: Server.RegisterService found duplicate service registration for %q", sd.ServiceName)
  	  }
  	  //初始化一个服务
  	  srv := &service{
  		  server: ss,
  		  md:     make(map[string]*MethodDesc),
  		  sd:     make(map[string]*StreamDesc),
  		  mdata:  sd.Metadata,
  	  }
  	  //根据名字映射方法
  	  for i := range sd.Methods {
  		  d := &sd.Methods[i]
  		  srv.md[d.MethodName] = d
  	  }
  	  for i := range sd.Streams {
  		  d := &sd.Streams[i]
  		  srv.sd[d.StreamName] = d
  	  }
  	  把服务注册到server中
  	  s.m[sd.ServiceName] = srv
    }
  #+END_SRC
  其实根据这个注册名字，我们已经能够大概猜到当客户端的请求到来时如何找到我们的方法。首先根据service name找到相应的service再根据方法名找到相应的方法，然后拿到我们自定义的结构调用这个方法。
