grpc_server.html
<div id="outline-container-orgf197dd2" class="outline-2">
<h2 id="orgf197dd2"><span class="section-number-2">2</span> 注册流程</h2>
<div class="outline-text-2" id="text-2">
<p>
想象一个rpc的流程, 客户端指明一个函数的函数名跟参数，服务端找到这个函数，然后把参数应用到这个函数上。所以一个注册服务流程，就是告诉grpc让收到一个rpc调用的时候，如何找到我们的函数。看一个最简单的服务端程序.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #ffad29; font-weight: bold;">type</span> <span style="color: #34cae2;">server</span> <span style="color: #ffad29; font-weight: bold;">struct</span><span style="color: #8c8c8c;">{}</span>
<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #8c8c8c;">(</span>s *<span style="color: #34cae2;">server</span><span style="color: #8c8c8c;">)</span> <span style="color: #00ede1; font-weight: bold;">SayHello</span><span style="color: #8c8c8c;">(</span>ctx <span style="color: #34cae2;">context.Context</span>, in *<span style="color: #34cae2;">pb.HelloRequest</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">(</span>*<span style="color: #34cae2;">pb.HelloReply</span>, <span style="color: #34cae2;">error</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #ffad29; font-weight: bold;">return</span> &amp;pb.<span style="color: #34cae2;">HelloReply</span><span style="color: #93a8c6;">{</span>Message: <span style="color: #e67128;">"Hello "</span> + in.Name<span style="color: #93a8c6;">}</span>, <span style="color: #008b8b;">nil</span>
<span style="color: #8c8c8c;">}</span>
<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #00ede1; font-weight: bold;">main</span><span style="color: #8c8c8c;">()</span> <span style="color: #8c8c8c;">{</span>
  lis, err := net.<span style="color: #00ede1; font-weight: bold;">Listen</span><span style="color: #93a8c6;">(</span><span style="color: #e67128;">"tcp"</span>, port<span style="color: #93a8c6;">)</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> err != <span style="color: #008b8b;">nil</span> <span style="color: #93a8c6;">{</span>
    log.<span style="color: #00ede1; font-weight: bold;">Fatalf</span><span style="color: #b0b1a3;">(</span><span style="color: #e67128;">"failed to listen: %v"</span>, err<span style="color: #b0b1a3;">)</span>
  <span style="color: #93a8c6;">}</span>
  s := grpc.<span style="color: #00ede1; font-weight: bold;">NewServer</span><span style="color: #93a8c6;">()</span>
  pb.<span style="color: #00ede1; font-weight: bold;">RegisterGreeterServer</span><span style="color: #93a8c6;">(</span>s, &amp;<span style="color: #34cae2;">server</span><span style="color: #b0b1a3;">{}</span><span style="color: #93a8c6;">)</span>
  reflection.<span style="color: #00ede1; font-weight: bold;">Register</span><span style="color: #93a8c6;">(</span>s<span style="color: #93a8c6;">)</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> err := s.<span style="color: #00ede1; font-weight: bold;">Serve</span><span style="color: #93a8c6;">(</span>lis<span style="color: #93a8c6;">)</span>; err != <span style="color: #008b8b;">nil</span> <span style="color: #93a8c6;">{</span>
    log.<span style="color: #00ede1; font-weight: bold;">Fatalf</span><span style="color: #b0b1a3;">(</span><span style="color: #e67128;">"failed to serve: %v"</span>, err<span style="color: #b0b1a3;">)</span>
  <span style="color: #93a8c6;">}</span>
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
<p>
一般的流程是先定义个proto文件，然后根据protoc工具生成go的grpc代码，这里的SayHello函数是你proto文件中声明的函数。然后你实现你声明的接口，然后再注册到server中，就可以供客户端调用了。
在grpc注册的过程中有几个概念:
</p>
<ol class="org-ol">
<li>Server</li>
<li>grpc Service</li>
<li>ServiceDesc</li>
<li>自己的service</li>
</ol>
<p>
自己的service很简单，就是上面的server结构体，这个结构实现了相应的interface。servicedesc相当于是一个根据proto文件来描述你server需要实现的功能的结构。grpc service, 你proto文件可能会声明多个service，你的Server也可以注册多个service。Server 原则上来说只需要一个server，一个server下有多个service，一个service下有多个方法。
我们看下RegisterGreeterServer这个方法
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #74af68;">//</span><span style="color: #74af68;">&#25551;&#36848;&#19968;&#20010;service&#20855;&#26377;&#21738;&#20123;&#26041;&#27861;</span>
<span style="color: #ffad29; font-weight: bold;">var</span> _Greeter_serviceDesc = grpc.<span style="color: #34cae2;">ServiceDesc</span><span style="color: #8c8c8c;">{</span>
  <span style="color: #008b8b;">ServiceName</span>: <span style="color: #e67128;">"helloworld.Greeter"</span>,
  <span style="color: #008b8b;">HandlerType</span>: <span style="color: #93a8c6;">(</span>*GreeterServer<span style="color: #93a8c6;">)(</span><span style="color: #008b8b;">nil</span><span style="color: #93a8c6;">)</span>,
  <span style="color: #008b8b;">Methods</span>: <span style="color: #93a8c6;">[]</span><span style="color: #34cae2;">grpc.MethodDesc</span><span style="color: #93a8c6;">{</span>
    <span style="color: #b0b1a3;">{</span>
      <span style="color: #008b8b;">MethodName</span>: <span style="color: #e67128;">"SayHello"</span>,
      <span style="color: #008b8b;">Handler</span>:    _Greeter_SayHello_Handler,
    <span style="color: #b0b1a3;">}</span>,
  <span style="color: #93a8c6;">}</span>,
  <span style="color: #008b8b;">Streams</span>:  <span style="color: #93a8c6;">[]</span><span style="color: #34cae2;">grpc.StreamDesc</span><span style="color: #93a8c6;">{}</span>,
  <span style="color: #008b8b;">Metadata</span>: <span style="color: #e67128;">"helloworld.proto"</span>,
<span style="color: #8c8c8c;">}</span>
<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #00ede1; font-weight: bold;">RegisterGreeterServer</span><span style="color: #8c8c8c;">(</span>s *<span style="color: #34cae2;">grpc.Server</span>, srv <span style="color: #34cae2;">GreeterServer</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  s.<span style="color: #00ede1; font-weight: bold;">RegisterService</span><span style="color: #93a8c6;">(</span>&amp;_Greeter_serviceDesc, srv<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">}</span>
<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #8c8c8c;">(</span>s *<span style="color: #34cae2;">Server</span><span style="color: #8c8c8c;">)</span> <span style="color: #00ede1; font-weight: bold;">RegisterService</span><span style="color: #8c8c8c;">(</span>sd *<span style="color: #34cae2;">ServiceDesc</span>, ss <span style="color: #ffad29; font-weight: bold;">interface</span><span style="color: #93a8c6;">{}</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  ht := reflect.<span style="color: #00ede1; font-weight: bold;">TypeOf</span><span style="color: #93a8c6;">(</span>sd.HandlerType<span style="color: #93a8c6;">)</span>.<span style="color: #00ede1; font-weight: bold;">Elem</span><span style="color: #93a8c6;">()</span>
  st := reflect.<span style="color: #00ede1; font-weight: bold;">TypeOf</span><span style="color: #93a8c6;">(</span>ss<span style="color: #93a8c6;">)</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#21028;&#26029;&#26159;&#21542;&#23454;&#29616;&#30456;&#24212;&#30340;&#25509;&#21475;</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> !st.<span style="color: #00ede1; font-weight: bold;">Implements</span><span style="color: #93a8c6;">(</span>ht<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    grpclog.<span style="color: #00ede1; font-weight: bold;">Fatalf</span><span style="color: #b0b1a3;">(</span><span style="color: #e67128;">"grpc: Server.RegisterService found the handler of type %v that does not satisfy %v"</span>, st, ht<span style="color: #b0b1a3;">)</span>
  <span style="color: #93a8c6;">}</span>
  s.<span style="color: #00ede1; font-weight: bold;">register</span><span style="color: #93a8c6;">(</span>sd, ss<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">}</span>
<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #8c8c8c;">(</span>s *<span style="color: #34cae2;">Server</span><span style="color: #8c8c8c;">)</span> <span style="color: #00ede1; font-weight: bold;">register</span><span style="color: #8c8c8c;">(</span>sd *<span style="color: #34cae2;">ServiceDesc</span>, ss <span style="color: #ffad29; font-weight: bold;">interface</span><span style="color: #93a8c6;">{}</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  s.mu.<span style="color: #00ede1; font-weight: bold;">Lock</span><span style="color: #93a8c6;">()</span>
  <span style="color: #ffad29; font-weight: bold;">defer</span> s.mu.<span style="color: #00ede1; font-weight: bold;">Unlock</span><span style="color: #93a8c6;">()</span>
  s.<span style="color: #00ede1; font-weight: bold;">printf</span><span style="color: #93a8c6;">(</span><span style="color: #e67128;">"RegisterService(%q)"</span>, sd.ServiceName<span style="color: #93a8c6;">)</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> _, ok := s.m<span style="color: #93a8c6;">[</span>sd.ServiceName<span style="color: #93a8c6;">]</span>; ok <span style="color: #93a8c6;">{</span>
    grpclog.<span style="color: #00ede1; font-weight: bold;">Fatalf</span><span style="color: #b0b1a3;">(</span><span style="color: #e67128;">"grpc: Server.RegisterService found duplicate service registration for %q"</span>, sd.ServiceName<span style="color: #b0b1a3;">)</span>
  <span style="color: #93a8c6;">}</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#21021;&#22987;&#21270;&#19968;&#20010;&#26381;&#21153;</span>
  srv := &amp;<span style="color: #34cae2;">service</span><span style="color: #93a8c6;">{</span>
    <span style="color: #008b8b;">server</span>: ss,
    <span style="color: #008b8b;">md</span>:     <span style="color: #23d7d7;">make</span><span style="color: #b0b1a3;">(</span><span style="color: #ffad29; font-weight: bold;">map</span><span style="color: #97b098;">[</span><span style="color: #34cae2;">string</span><span style="color: #97b098;">]</span>*<span style="color: #34cae2;">MethodDesc</span><span style="color: #b0b1a3;">)</span>,
    <span style="color: #008b8b;">sd</span>:     <span style="color: #23d7d7;">make</span><span style="color: #b0b1a3;">(</span><span style="color: #ffad29; font-weight: bold;">map</span><span style="color: #97b098;">[</span><span style="color: #34cae2;">string</span><span style="color: #97b098;">]</span>*<span style="color: #34cae2;">StreamDesc</span><span style="color: #b0b1a3;">)</span>,
    <span style="color: #008b8b;">mdata</span>:  sd.Metadata,
  <span style="color: #93a8c6;">}</span>
  <span style="color: #74af68;">//</span><span style="color: #74af68;">&#26681;&#25454;&#21517;&#23383;&#26144;&#23556;&#26041;&#27861;</span>
  <span style="color: #ffad29; font-weight: bold;">for</span> i := <span style="color: #ffad29; font-weight: bold;">range</span> sd.Methods <span style="color: #93a8c6;">{</span>
    d := &amp;sd.Methods<span style="color: #b0b1a3;">[</span>i<span style="color: #b0b1a3;">]</span>
    srv.md<span style="color: #b0b1a3;">[</span>d.MethodName<span style="color: #b0b1a3;">]</span> = d
  <span style="color: #93a8c6;">}</span>
  <span style="color: #ffad29; font-weight: bold;">for</span> i := <span style="color: #ffad29; font-weight: bold;">range</span> sd.Streams <span style="color: #93a8c6;">{</span>
    d := &amp;sd.Streams<span style="color: #b0b1a3;">[</span>i<span style="color: #b0b1a3;">]</span>
    srv.sd<span style="color: #b0b1a3;">[</span>d.StreamName<span style="color: #b0b1a3;">]</span> = d
  <span style="color: #93a8c6;">}</span>
  &#25226;&#26381;&#21153;&#27880;&#20876;&#21040;server&#20013;
  s.m<span style="color: #93a8c6;">[</span>sd.ServiceName<span style="color: #93a8c6;">]</span> = srv
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
<p>
其实根据这个注册名字，我们已经能够大概猜到当客户端的请求到来时如何找到我们的方法。首先根据service name找到相应的service再根据方法名找到相应的方法，然后拿到我们自定义的结构调用这个方法。
</p>
</div>
</div>
