org/grpc_server.org
* 调用流程
  注册流程看完了，接下来再来看下让一个请求到达服务端的时候是如何处理。
  在Server中的Serve方法中，服务端通过监听请求的到来，通过for循环不断接受到来的连接。
  #+BEGIN_SRC go
    //去掉一些错误处理的代码后，十分简洁
      func (s *Server) Serve(lis net.Listener) error {
        ..........

        for {
      	  rawConn, err := lis.Accept()
      	  .............

      	  // Start a new goroutine to deal with rawConn
      	  // so we don't stall this Accept loop goroutine.
      	  go s.handleRawConn(rawConn)
        }
      }
    //最后通过http2创建一个stream，来收取消息

    func (s *Server) serveStreams(st transport.ServerTransport) {
      defer s.removeConn(st)
      defer st.Close()
      var wg sync.WaitGroup
      st.HandleStreams(func(stream *transport.Stream) {
    	  wg.Add(1)
    	  go func() {
    		  defer wg.Done()
    		  s.handleStream(st, stream, s.traceInfo(st, stream))
    	  }()
      }, func(ctx context.Context, method string) context.Context {
    	  if !EnableTracing {
    		  return ctx
    	  }
    	  tr := trace.New("grpc.Recv."+methodFamily(method), method)
    	  return trace.NewContext(ctx, tr)
      })
      wg.Wait()
    }

    func (s *Server) handleStream(t transport.ServerTransport, stream *transport.Stream, trInfo *traceInfo) {
      sm := stream.Method()
      if sm != "" && sm[0] == '/' {
    	  sm = sm[1:]
      }
      pos := strings.LastIndex(sm, "/")

      ............
    	  //从这里到服务和注册的方法
      service := sm[:pos]
      method := sm[pos+1:]
      srv, ok := s.m[service]

      .................

      // Unary RPC or Streaming RPC?
      if md, ok := srv.md[method]; ok {
    	  s.processUnaryRPC(t, stream, srv, md, trInfo)
    	  return
      }
      if sd, ok := srv.sd[method]; ok {
    	  s.processStreamingRPC(t, stream, srv, sd, trInfo)
    	  return
      }

      ...........

    }

    //接下来是最主要的处理函数
    func (s *Server) processUnaryRPC(t transport.ServerTransport, stream *transport.Stream, srv *service, md *MethodDesc, trInfo *traceInfo) (err error) {
  	  if stats.On() {
  		  begin := &stats.Begin{
  			  BeginTime: time.Now(),
  		  }
  		  stats.HandleRPC(stream.Context(), begin)
  	  }
  	  defer func() {
  		  if stats.On() {
  			  end := &stats.End{
  				  EndTime: time.Now(),
  			  }
  			  if err != nil && err != io.EOF {
  				  end.Error = toRPCErr(err)
  			  }
  			  stats.HandleRPC(stream.Context(), end)
  		  }
  	  }()
  	  if trInfo != nil {
  		  defer trInfo.tr.Finish()
  		  trInfo.firstLine.client = false
  		  trInfo.tr.LazyLog(&trInfo.firstLine, false)
  		  defer func() {
  			  if err != nil && err != io.EOF {
  				  trInfo.tr.LazyLog(&fmtStringer{"%v", []interface{}{err}}, true)
  				  trInfo.tr.SetError()
  			  }
  		  }()
  	  }
  	  if s.opts.cp != nil {
  		  // NOTE: this needs to be ahead of all handling, https://github.com/grpc/grpc-go/issues/686.
  		  stream.SetSendCompress(s.opts.cp.Type())
  	  }
  	  p := &parser{r: stream}
  	  for {
  		  pf, req, err := p.recvMsg(s.opts.maxMsgSize)
  		  if err == io.EOF {
  			  // The entire stream is done (for unary RPC only).
  			  return err
  		  }

  		  .............

  		  if err := checkRecvPayload(pf, stream.RecvCompress(), s.opts.dc); err != nil {
  			  switch err := err.(type) {
  			  case *rpcError:
  				  if e := t.WriteStatus(stream, err.code, err.desc); e != nil {
  					  grpclog.Printf("grpc: Server.processUnaryRPC failed to write status %v", e)
  				  }
  				  return err
  			  default:
  				  if e := t.WriteStatus(stream, codes.Internal, err.Error()); e != nil {
  					  grpclog.Printf("grpc: Server.processUnaryRPC failed to write status %v", e)
  				  }
  				  // TODO checkRecvPayload always return RPC error. Add a return here if necessary.
  			  }
  		  }
  		  var inPayload *stats.InPayload
  		  if stats.On() {
  			  inPayload = &stats.InPayload{
  				  RecvTime: time.Now(),
  			  }
  		  }
  		  statusCode := codes.OK
  		  statusDesc := ""
  		  //df函数主要用于读取http2请求并反序列化到v中(相当于一个解包的操作)
  		  df := func(v interface{}) error {
  			  if inPayload != nil {
  				  inPayload.WireLength = len(req)
  			  }
  			  if pf == compressionMade {
  				  var err error
  				  req, err = s.opts.dc.Do(bytes.NewReader(req))
  				  if err != nil {
  					  if err := t.WriteStatus(stream, codes.Internal, err.Error()); err != nil {
  						  grpclog.Printf("grpc: Server.processUnaryRPC failed to write status %v", err)
  					  }
  					  return Errorf(codes.Internal, err.Error())
  				  }
  			  }
  			  if len(req) > s.opts.maxMsgSize {
  				  // TODO: Revisit the error code. Currently keep it consistent with
  				  // java implementation.
  				  statusCode = codes.Internal
  				  statusDesc = fmt.Sprintf("grpc: server received a message of %d bytes exceeding %d limit", len(req), s.opts.maxMsgSize)
  			  }
  			  if err := s.opts.codec.Unmarshal(req, v); err != nil {
  				  return err
  			  }
  			  if inPayload != nil {
  				  inPayload.Payload = v
  				  inPayload.Data = req
  				  inPayload.Length = len(req)
  				  stats.HandleRPC(stream.Context(), inPayload)
  			  }
  			  if trInfo != nil {
  				  trInfo.tr.LazyLog(&payload{sent: false, msg: v}, true)
  			  }
  			  return nil
  		  }
  		  //这些我们注册的函数
  		  reply, appErr := md.Handler(srv.server, stream.Context(), df, s.opts.unaryInt)
		
  		  .....................
		
  		  opts := &transport.Options{
  			  Last:  true,
  			  Delay: false,
  		  }
  		  //发结果发送出去
  		  if err := s.sendResponse(t, stream, reply, s.opts.cp, opts); err != nil {
  			  switch err := err.(type) {
  			  case transport.ConnectionError:
  				  // Nothing to do here.
  			  case transport.StreamError:
  				  statusCode = err.Code
  				  statusDesc = err.Desc
  			  default:
  				  statusCode = codes.Unknown
  				  statusDesc = err.Error()
  			  }
  			  return err
  		  }
  		  if trInfo != nil {
  			  trInfo.tr.LazyLog(&payload{sent: true, msg: reply}, true)
  		  }
  		  errWrite := t.WriteStatus(stream, statusCode, statusDesc)
  		  if statusCode != codes.OK {
  			  return Errorf(statusCode, statusDesc)
  		  }
  		  return errWrite
  	  }
    }
  #+END_SRC
  grpc服务端的基本流程就是这样了，我只是看的一个基本流程，再没遇到问题时，基本上不会再看grpc源码了。目前公司项目中在使用grpc，等有了坑，我再来总结吧

