grpc_server.html
<div id="outline-container-org042b16d" class="outline-2">
<h2 id="org042b16d"><span class="section-number-2">3</span> 调用流程</h2>
<div class="outline-text-2" id="text-3">
<p>
注册流程看完了，接下来再来看下让一个请求到达服务端的时候是如何处理。
在Server中的Serve方法中，服务端通过监听请求的到来，通过for循环不断接受到来的连接。
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #74af68;">//</span><span style="color: #74af68;">&#21435;&#25481;&#19968;&#20123;&#38169;&#35823;&#22788;&#29702;&#30340;&#20195;&#30721;&#21518;&#65292;&#21313;&#20998;&#31616;&#27905;</span>
  <span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #8c8c8c;">(</span>s *<span style="color: #34cae2;">Server</span><span style="color: #8c8c8c;">)</span> <span style="color: #00ede1; font-weight: bold;">Serve</span><span style="color: #8c8c8c;">(</span>lis <span style="color: #34cae2;">net.Listener</span><span style="color: #8c8c8c;">)</span> <span style="color: #34cae2;">error</span> <span style="color: #8c8c8c;">{</span>
    ..........

    <span style="color: #ffad29; font-weight: bold;">for</span> <span style="color: #93a8c6;">{</span>
      rawConn, err := lis.<span style="color: #00ede1; font-weight: bold;">Accept</span><span style="color: #b0b1a3;">()</span>
      .............

      <span style="color: #74af68;">// </span><span style="color: #74af68;">Start a new goroutine to deal with rawConn</span>
      <span style="color: #74af68;">// </span><span style="color: #74af68;">so we don't stall this Accept loop goroutine.</span>
      <span style="color: #ffad29; font-weight: bold;">go</span> s.<span style="color: #00ede1; font-weight: bold;">handleRawConn</span><span style="color: #b0b1a3;">(</span>rawConn<span style="color: #b0b1a3;">)</span>
    <span style="color: #93a8c6;">}</span>
  <span style="color: #8c8c8c;">}</span>
<span style="color: #74af68;">//</span><span style="color: #74af68;">&#26368;&#21518;&#36890;&#36807;http2&#21019;&#24314;&#19968;&#20010;stream&#65292;&#26469;&#25910;&#21462;&#28040;&#24687;</span>

<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #8c8c8c;">(</span>s *<span style="color: #34cae2;">Server</span><span style="color: #8c8c8c;">)</span> <span style="color: #00ede1; font-weight: bold;">serveStreams</span><span style="color: #8c8c8c;">(</span>st <span style="color: #34cae2;">transport.ServerTransport</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #ffad29; font-weight: bold;">defer</span> s.<span style="color: #00ede1; font-weight: bold;">removeConn</span><span style="color: #93a8c6;">(</span>st<span style="color: #93a8c6;">)</span>
  <span style="color: #ffad29; font-weight: bold;">defer</span> st.<span style="color: #00ede1; font-weight: bold;">Close</span><span style="color: #93a8c6;">()</span>
  <span style="color: #ffad29; font-weight: bold;">var</span> wg sync.WaitGroup
  st.<span style="color: #00ede1; font-weight: bold;">HandleStreams</span><span style="color: #93a8c6;">(</span><span style="color: #ffad29; font-weight: bold;">func</span><span style="color: #b0b1a3;">(</span>stream *<span style="color: #34cae2;">transport.Stream</span><span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">{</span>
    wg.<span style="color: #00ede1; font-weight: bold;">Add</span><span style="color: #97b098;">(</span><span style="color: #008b8b;">1</span><span style="color: #97b098;">)</span>
    <span style="color: #ffad29; font-weight: bold;">go</span> <span style="color: #ffad29; font-weight: bold;">func</span><span style="color: #97b098;">()</span> <span style="color: #97b098;">{</span>
      <span style="color: #ffad29; font-weight: bold;">defer</span> wg.<span style="color: #00ede1; font-weight: bold;">Done</span><span style="color: #aebed8;">()</span>
      s.<span style="color: #00ede1; font-weight: bold;">handleStream</span><span style="color: #aebed8;">(</span>st, stream, s.<span style="color: #00ede1; font-weight: bold;">traceInfo</span><span style="color: #b0b0b3;">(</span>st, stream<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
    <span style="color: #97b098;">}()</span>
  <span style="color: #b0b1a3;">}</span>, <span style="color: #ffad29; font-weight: bold;">func</span><span style="color: #b0b1a3;">(</span>ctx <span style="color: #34cae2;">context.Context</span>, method <span style="color: #34cae2;">string</span><span style="color: #b0b1a3;">)</span> <span style="color: #34cae2;">context.Context</span> <span style="color: #b0b1a3;">{</span>
    <span style="color: #ffad29; font-weight: bold;">if</span> !EnableTracing <span style="color: #97b098;">{</span>
      <span style="color: #ffad29; font-weight: bold;">return</span> ctx
    <span style="color: #97b098;">}</span>
    tr := trace.<span style="color: #00ede1; font-weight: bold;">New</span><span style="color: #97b098;">(</span><span style="color: #e67128;">"grpc.Recv."</span>+<span style="color: #00ede1; font-weight: bold;">methodFamily</span><span style="color: #aebed8;">(</span>method<span style="color: #aebed8;">)</span>, method<span style="color: #97b098;">)</span>
    <span style="color: #ffad29; font-weight: bold;">return</span> trace.<span style="color: #00ede1; font-weight: bold;">NewContext</span><span style="color: #97b098;">(</span>ctx, tr<span style="color: #97b098;">)</span>
  <span style="color: #b0b1a3;">}</span><span style="color: #93a8c6;">)</span>
  wg.<span style="color: #00ede1; font-weight: bold;">Wait</span><span style="color: #93a8c6;">()</span>
<span style="color: #8c8c8c;">}</span>

<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #8c8c8c;">(</span>s *<span style="color: #34cae2;">Server</span><span style="color: #8c8c8c;">)</span> <span style="color: #00ede1; font-weight: bold;">handleStream</span><span style="color: #8c8c8c;">(</span>t <span style="color: #34cae2;">transport.ServerTransport</span>, stream *<span style="color: #34cae2;">transport.Stream</span>, trInfo *<span style="color: #34cae2;">traceInfo</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  sm := stream.<span style="color: #00ede1; font-weight: bold;">Method</span><span style="color: #93a8c6;">()</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> sm != <span style="color: #e67128;">""</span> &amp;&amp; sm<span style="color: #93a8c6;">[</span><span style="color: #008b8b;">0</span><span style="color: #93a8c6;">]</span> == <span style="color: #e67128;">'/'</span> <span style="color: #93a8c6;">{</span>
    sm = sm<span style="color: #b0b1a3;">[</span><span style="color: #008b8b;">1</span>:<span style="color: #b0b1a3;">]</span>
  <span style="color: #93a8c6;">}</span>
  pos := strings.<span style="color: #00ede1; font-weight: bold;">LastIndex</span><span style="color: #93a8c6;">(</span>sm, <span style="color: #e67128;">"/"</span><span style="color: #93a8c6;">)</span>

  ............
    <span style="color: #74af68;">//</span><span style="color: #74af68;">&#20174;&#36825;&#37324;&#21040;&#26381;&#21153;&#21644;&#27880;&#20876;&#30340;&#26041;&#27861;</span>
  service := sm<span style="color: #93a8c6;">[</span>:pos<span style="color: #93a8c6;">]</span>
  method := sm<span style="color: #93a8c6;">[</span>pos+<span style="color: #008b8b;">1</span>:<span style="color: #93a8c6;">]</span>
  srv, ok := s.m<span style="color: #93a8c6;">[</span>service<span style="color: #93a8c6;">]</span>

  .................

  <span style="color: #74af68;">// </span><span style="color: #74af68;">Unary RPC or Streaming RPC?</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> md, ok := srv.md<span style="color: #93a8c6;">[</span>method<span style="color: #93a8c6;">]</span>; ok <span style="color: #93a8c6;">{</span>
    s.<span style="color: #00ede1; font-weight: bold;">processUnaryRPC</span><span style="color: #b0b1a3;">(</span>t, stream, srv, md, trInfo<span style="color: #b0b1a3;">)</span>
    <span style="color: #ffad29; font-weight: bold;">return</span>
  <span style="color: #93a8c6;">}</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> sd, ok := srv.sd<span style="color: #93a8c6;">[</span>method<span style="color: #93a8c6;">]</span>; ok <span style="color: #93a8c6;">{</span>
    s.<span style="color: #00ede1; font-weight: bold;">processStreamingRPC</span><span style="color: #b0b1a3;">(</span>t, stream, srv, sd, trInfo<span style="color: #b0b1a3;">)</span>
    <span style="color: #ffad29; font-weight: bold;">return</span>
  <span style="color: #93a8c6;">}</span>

  ...........

<span style="color: #8c8c8c;">}</span>

<span style="color: #74af68;">//</span><span style="color: #74af68;">&#25509;&#19979;&#26469;&#26159;&#26368;&#20027;&#35201;&#30340;&#22788;&#29702;&#20989;&#25968;</span>
<span style="color: #ffad29; font-weight: bold;">func</span> <span style="color: #8c8c8c;">(</span>s *<span style="color: #34cae2;">Server</span><span style="color: #8c8c8c;">)</span> <span style="color: #00ede1; font-weight: bold;">processUnaryRPC</span><span style="color: #8c8c8c;">(</span>t <span style="color: #34cae2;">transport.ServerTransport</span>, stream *<span style="color: #34cae2;">transport.Stream</span>, srv *<span style="color: #34cae2;">service</span>, md *<span style="color: #34cae2;">MethodDesc</span>, trInfo *<span style="color: #34cae2;">traceInfo</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">(</span>err <span style="color: #34cae2;">error</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> stats.<span style="color: #00ede1; font-weight: bold;">On</span><span style="color: #93a8c6;">()</span> <span style="color: #93a8c6;">{</span>
    begin := &amp;stats.<span style="color: #34cae2;">Begin</span><span style="color: #b0b1a3;">{</span>
      <span style="color: #008b8b;">BeginTime</span>: time.<span style="color: #00ede1; font-weight: bold;">Now</span><span style="color: #97b098;">()</span>,
    <span style="color: #b0b1a3;">}</span>
    stats.<span style="color: #00ede1; font-weight: bold;">HandleRPC</span><span style="color: #b0b1a3;">(</span>stream.<span style="color: #00ede1; font-weight: bold;">Context</span><span style="color: #97b098;">()</span>, begin<span style="color: #b0b1a3;">)</span>
  <span style="color: #93a8c6;">}</span>
  <span style="color: #ffad29; font-weight: bold;">defer</span> <span style="color: #ffad29; font-weight: bold;">func</span><span style="color: #93a8c6;">()</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #ffad29; font-weight: bold;">if</span> stats.<span style="color: #00ede1; font-weight: bold;">On</span><span style="color: #b0b1a3;">()</span> <span style="color: #b0b1a3;">{</span>
      end := &amp;stats.<span style="color: #34cae2;">End</span><span style="color: #97b098;">{</span>
        <span style="color: #008b8b;">EndTime</span>: time.<span style="color: #00ede1; font-weight: bold;">Now</span><span style="color: #aebed8;">()</span>,
      <span style="color: #97b098;">}</span>
      <span style="color: #ffad29; font-weight: bold;">if</span> err != <span style="color: #008b8b;">nil</span> &amp;&amp; err != io.EOF <span style="color: #97b098;">{</span>
        end.Error = <span style="color: #00ede1; font-weight: bold;">toRPCErr</span><span style="color: #aebed8;">(</span>err<span style="color: #aebed8;">)</span>
      <span style="color: #97b098;">}</span>
      stats.<span style="color: #00ede1; font-weight: bold;">HandleRPC</span><span style="color: #97b098;">(</span>stream.<span style="color: #00ede1; font-weight: bold;">Context</span><span style="color: #aebed8;">()</span>, end<span style="color: #97b098;">)</span>
    <span style="color: #b0b1a3;">}</span>
  <span style="color: #93a8c6;">}()</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> trInfo != <span style="color: #008b8b;">nil</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #ffad29; font-weight: bold;">defer</span> trInfo.tr.<span style="color: #00ede1; font-weight: bold;">Finish</span><span style="color: #b0b1a3;">()</span>
    trInfo.firstLine.client = <span style="color: #008b8b;">false</span>
    trInfo.tr.<span style="color: #00ede1; font-weight: bold;">LazyLog</span><span style="color: #b0b1a3;">(</span>&amp;trInfo.firstLine, <span style="color: #008b8b;">false</span><span style="color: #b0b1a3;">)</span>
    <span style="color: #ffad29; font-weight: bold;">defer</span> <span style="color: #ffad29; font-weight: bold;">func</span><span style="color: #b0b1a3;">()</span> <span style="color: #b0b1a3;">{</span>
      <span style="color: #ffad29; font-weight: bold;">if</span> err != <span style="color: #008b8b;">nil</span> &amp;&amp; err != io.EOF <span style="color: #97b098;">{</span>
        trInfo.tr.<span style="color: #00ede1; font-weight: bold;">LazyLog</span><span style="color: #aebed8;">(</span>&amp;<span style="color: #34cae2;">fmtStringer</span><span style="color: #b0b0b3;">{</span><span style="color: #e67128;">"%v"</span>, <span style="color: #90a890;">[]</span><span style="color: #ffad29; font-weight: bold;">interface</span><span style="color: #90a890;">{}{</span>err<span style="color: #90a890;">}</span><span style="color: #b0b0b3;">}</span>, <span style="color: #008b8b;">true</span><span style="color: #aebed8;">)</span>
        trInfo.tr.<span style="color: #00ede1; font-weight: bold;">SetError</span><span style="color: #aebed8;">()</span>
      <span style="color: #97b098;">}</span>
    <span style="color: #b0b1a3;">}()</span>
  <span style="color: #93a8c6;">}</span>
  <span style="color: #ffad29; font-weight: bold;">if</span> s.opts.cp != <span style="color: #008b8b;">nil</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #74af68;">// </span><span style="color: #d0bf8f;">NOTE</span><span style="color: #74af68;">: this needs to be ahead of all handling, https://github.com/grpc/grpc-go/issues/686.</span>
    stream.<span style="color: #00ede1; font-weight: bold;">SetSendCompress</span><span style="color: #b0b1a3;">(</span>s.opts.cp.<span style="color: #00ede1; font-weight: bold;">Type</span><span style="color: #97b098;">()</span><span style="color: #b0b1a3;">)</span>
  <span style="color: #93a8c6;">}</span>
  p := &amp;<span style="color: #34cae2;">parser</span><span style="color: #93a8c6;">{</span>r: stream<span style="color: #93a8c6;">}</span>
  <span style="color: #ffad29; font-weight: bold;">for</span> <span style="color: #93a8c6;">{</span>
    pf, req, err := p.<span style="color: #00ede1; font-weight: bold;">recvMsg</span><span style="color: #b0b1a3;">(</span>s.opts.maxMsgSize<span style="color: #b0b1a3;">)</span>
    <span style="color: #ffad29; font-weight: bold;">if</span> err == io.EOF <span style="color: #b0b1a3;">{</span>
      <span style="color: #74af68;">// </span><span style="color: #74af68;">The entire stream is done (for unary RPC only).</span>
      <span style="color: #ffad29; font-weight: bold;">return</span> err
    <span style="color: #b0b1a3;">}</span>

    .............

    <span style="color: #ffad29; font-weight: bold;">if</span> err := <span style="color: #00ede1; font-weight: bold;">checkRecvPayload</span><span style="color: #b0b1a3;">(</span>pf, stream.<span style="color: #00ede1; font-weight: bold;">RecvCompress</span><span style="color: #97b098;">()</span>, s.opts.dc<span style="color: #b0b1a3;">)</span>; err != <span style="color: #008b8b;">nil</span> <span style="color: #b0b1a3;">{</span>
      <span style="color: #ffad29; font-weight: bold;">switch</span> err := err.<span style="color: #97b098;">(</span><span style="color: #ffad29; font-weight: bold;">type</span><span style="color: #97b098;">)</span> <span style="color: #97b098;">{</span>
      <span style="color: #ffad29; font-weight: bold;">case</span> *rpcError:
        <span style="color: #ffad29; font-weight: bold;">if</span> e := t.<span style="color: #00ede1; font-weight: bold;">WriteStatus</span><span style="color: #aebed8;">(</span>stream, err.code, err.desc<span style="color: #aebed8;">)</span>; e != <span style="color: #008b8b;">nil</span> <span style="color: #aebed8;">{</span>
          grpclog.<span style="color: #00ede1; font-weight: bold;">Printf</span><span style="color: #b0b0b3;">(</span><span style="color: #e67128;">"grpc: Server.processUnaryRPC failed to write status %v"</span>, e<span style="color: #b0b0b3;">)</span>
        <span style="color: #aebed8;">}</span>
        <span style="color: #ffad29; font-weight: bold;">return</span> err
      <span style="color: #ffad29; font-weight: bold;">default</span>:
        <span style="color: #ffad29; font-weight: bold;">if</span> e := t.<span style="color: #00ede1; font-weight: bold;">WriteStatus</span><span style="color: #aebed8;">(</span>stream, codes.Internal, err.<span style="color: #00ede1; font-weight: bold;">Error</span><span style="color: #b0b0b3;">()</span><span style="color: #aebed8;">)</span>; e != <span style="color: #008b8b;">nil</span> <span style="color: #aebed8;">{</span>
          grpclog.<span style="color: #00ede1; font-weight: bold;">Printf</span><span style="color: #b0b0b3;">(</span><span style="color: #e67128;">"grpc: Server.processUnaryRPC failed to write status %v"</span>, e<span style="color: #b0b0b3;">)</span>
        <span style="color: #aebed8;">}</span>
        <span style="color: #74af68;">// </span><span style="color: #cc9393;">TODO</span><span style="color: #74af68;"> checkRecvPayload always return RPC error. Add a return here if necessary.</span>
      <span style="color: #97b098;">}</span>
    <span style="color: #b0b1a3;">}</span>
    <span style="color: #ffad29; font-weight: bold;">var</span> inPayload *stats.InPayload
    <span style="color: #ffad29; font-weight: bold;">if</span> stats.<span style="color: #00ede1; font-weight: bold;">On</span><span style="color: #b0b1a3;">()</span> <span style="color: #b0b1a3;">{</span>
      inPayload = &amp;stats.<span style="color: #34cae2;">InPayload</span><span style="color: #97b098;">{</span>
        <span style="color: #008b8b;">RecvTime</span>: time.<span style="color: #00ede1; font-weight: bold;">Now</span><span style="color: #aebed8;">()</span>,
      <span style="color: #97b098;">}</span>
    <span style="color: #b0b1a3;">}</span>
    statusCode := codes.OK
    statusDesc := <span style="color: #e67128;">""</span>
    <span style="color: #74af68;">//</span><span style="color: #74af68;">df&#20989;&#25968;&#20027;&#35201;&#29992;&#20110;&#35835;&#21462;http2&#35831;&#27714;&#24182;&#21453;&#24207;&#21015;&#21270;&#21040;v&#20013;(&#30456;&#24403;&#20110;&#19968;&#20010;&#35299;&#21253;&#30340;&#25805;&#20316;)</span>
    df := <span style="color: #ffad29; font-weight: bold;">func</span><span style="color: #b0b1a3;">(</span>v <span style="color: #ffad29; font-weight: bold;">interface</span><span style="color: #97b098;">{}</span><span style="color: #b0b1a3;">)</span> <span style="color: #34cae2;">error</span> <span style="color: #b0b1a3;">{</span>
      <span style="color: #ffad29; font-weight: bold;">if</span> inPayload != <span style="color: #008b8b;">nil</span> <span style="color: #97b098;">{</span>
        inPayload.WireLength = <span style="color: #23d7d7;">len</span><span style="color: #aebed8;">(</span>req<span style="color: #aebed8;">)</span>
      <span style="color: #97b098;">}</span>
      <span style="color: #ffad29; font-weight: bold;">if</span> pf == compressionMade <span style="color: #97b098;">{</span>
        <span style="color: #ffad29; font-weight: bold;">var</span> err error
        req, err = s.opts.dc.<span style="color: #00ede1; font-weight: bold;">Do</span><span style="color: #aebed8;">(</span>bytes.<span style="color: #00ede1; font-weight: bold;">NewReader</span><span style="color: #b0b0b3;">(</span>req<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>
        <span style="color: #ffad29; font-weight: bold;">if</span> err != <span style="color: #008b8b;">nil</span> <span style="color: #aebed8;">{</span>
          <span style="color: #ffad29; font-weight: bold;">if</span> err := t.<span style="color: #00ede1; font-weight: bold;">WriteStatus</span><span style="color: #b0b0b3;">(</span>stream, codes.Internal, err.<span style="color: #00ede1; font-weight: bold;">Error</span><span style="color: #90a890;">()</span><span style="color: #b0b0b3;">)</span>; err != <span style="color: #008b8b;">nil</span> <span style="color: #b0b0b3;">{</span>
            grpclog.<span style="color: #00ede1; font-weight: bold;">Printf</span><span style="color: #90a890;">(</span><span style="color: #e67128;">"grpc: Server.processUnaryRPC failed to write status %v"</span>, err<span style="color: #90a890;">)</span>
          <span style="color: #b0b0b3;">}</span>
          <span style="color: #ffad29; font-weight: bold;">return</span> <span style="color: #00ede1; font-weight: bold;">Errorf</span><span style="color: #b0b0b3;">(</span>codes.Internal, err.<span style="color: #00ede1; font-weight: bold;">Error</span><span style="color: #90a890;">()</span><span style="color: #b0b0b3;">)</span>
        <span style="color: #aebed8;">}</span>
      <span style="color: #97b098;">}</span>
      <span style="color: #ffad29; font-weight: bold;">if</span> <span style="color: #23d7d7;">len</span><span style="color: #97b098;">(</span>req<span style="color: #97b098;">)</span> &gt; s.opts.maxMsgSize <span style="color: #97b098;">{</span>
        <span style="color: #74af68;">// </span><span style="color: #cc9393;">TODO</span><span style="color: #74af68;">: Revisit the error code. Currently keep it consistent with</span>
        <span style="color: #74af68;">// </span><span style="color: #74af68;">java implementation.</span>
        statusCode = codes.Internal
        statusDesc = fmt.<span style="color: #00ede1; font-weight: bold;">Sprintf</span><span style="color: #aebed8;">(</span><span style="color: #e67128;">"grpc: server received a message of %d bytes exceeding %d limit"</span>, <span style="color: #23d7d7;">len</span><span style="color: #b0b0b3;">(</span>req<span style="color: #b0b0b3;">)</span>, s.opts.maxMsgSize<span style="color: #aebed8;">)</span>
      <span style="color: #97b098;">}</span>
      <span style="color: #ffad29; font-weight: bold;">if</span> err := s.opts.codec.<span style="color: #00ede1; font-weight: bold;">Unmarshal</span><span style="color: #97b098;">(</span>req, v<span style="color: #97b098;">)</span>; err != <span style="color: #008b8b;">nil</span> <span style="color: #97b098;">{</span>
        <span style="color: #ffad29; font-weight: bold;">return</span> err
      <span style="color: #97b098;">}</span>
      <span style="color: #ffad29; font-weight: bold;">if</span> inPayload != <span style="color: #008b8b;">nil</span> <span style="color: #97b098;">{</span>
        inPayload.Payload = v
        inPayload.Data = req
        inPayload.Length = <span style="color: #23d7d7;">len</span><span style="color: #aebed8;">(</span>req<span style="color: #aebed8;">)</span>
        stats.<span style="color: #00ede1; font-weight: bold;">HandleRPC</span><span style="color: #aebed8;">(</span>stream.<span style="color: #00ede1; font-weight: bold;">Context</span><span style="color: #b0b0b3;">()</span>, inPayload<span style="color: #aebed8;">)</span>
      <span style="color: #97b098;">}</span>
      <span style="color: #ffad29; font-weight: bold;">if</span> trInfo != <span style="color: #008b8b;">nil</span> <span style="color: #97b098;">{</span>
        trInfo.tr.<span style="color: #00ede1; font-weight: bold;">LazyLog</span><span style="color: #aebed8;">(</span>&amp;<span style="color: #34cae2;">payload</span><span style="color: #b0b0b3;">{</span>sent: <span style="color: #008b8b;">false</span>, msg: v<span style="color: #b0b0b3;">}</span>, <span style="color: #008b8b;">true</span><span style="color: #aebed8;">)</span>
      <span style="color: #97b098;">}</span>
      <span style="color: #ffad29; font-weight: bold;">return</span> <span style="color: #008b8b;">nil</span>
    <span style="color: #b0b1a3;">}</span>
    <span style="color: #74af68;">//</span><span style="color: #74af68;">&#36825;&#20123;&#25105;&#20204;&#27880;&#20876;&#30340;&#20989;&#25968;</span>
    reply, appErr := md.<span style="color: #00ede1; font-weight: bold;">Handler</span><span style="color: #b0b1a3;">(</span>srv.server, stream.<span style="color: #00ede1; font-weight: bold;">Context</span><span style="color: #97b098;">()</span>, df, s.opts.unaryInt<span style="color: #b0b1a3;">)</span>

    .....................

    opts := &amp;transport.<span style="color: #34cae2;">Options</span><span style="color: #b0b1a3;">{</span>
      <span style="color: #008b8b;">Last</span>:  <span style="color: #008b8b;">true</span>,
      <span style="color: #008b8b;">Delay</span>: <span style="color: #008b8b;">false</span>,
    <span style="color: #b0b1a3;">}</span>
    <span style="color: #74af68;">//</span><span style="color: #74af68;">&#21457;&#32467;&#26524;&#21457;&#36865;&#20986;&#21435;</span>
    <span style="color: #ffad29; font-weight: bold;">if</span> err := s.<span style="color: #00ede1; font-weight: bold;">sendResponse</span><span style="color: #b0b1a3;">(</span>t, stream, reply, s.opts.cp, opts<span style="color: #b0b1a3;">)</span>; err != <span style="color: #008b8b;">nil</span> <span style="color: #b0b1a3;">{</span>
      <span style="color: #ffad29; font-weight: bold;">switch</span> err := err.<span style="color: #97b098;">(</span><span style="color: #ffad29; font-weight: bold;">type</span><span style="color: #97b098;">)</span> <span style="color: #97b098;">{</span>
      <span style="color: #ffad29; font-weight: bold;">case</span> transport.ConnectionError:
        <span style="color: #74af68;">// </span><span style="color: #74af68;">Nothing to do here.</span>
      <span style="color: #ffad29; font-weight: bold;">case</span> transport.StreamError:
        statusCode = err.Code
        statusDesc = err.Desc
      <span style="color: #ffad29; font-weight: bold;">default</span>:
        statusCode = codes.Unknown
        statusDesc = err.<span style="color: #00ede1; font-weight: bold;">Error</span><span style="color: #aebed8;">()</span>
      <span style="color: #97b098;">}</span>
      <span style="color: #ffad29; font-weight: bold;">return</span> err
    <span style="color: #b0b1a3;">}</span>
    <span style="color: #ffad29; font-weight: bold;">if</span> trInfo != <span style="color: #008b8b;">nil</span> <span style="color: #b0b1a3;">{</span>
      trInfo.tr.<span style="color: #00ede1; font-weight: bold;">LazyLog</span><span style="color: #97b098;">(</span>&amp;<span style="color: #34cae2;">payload</span><span style="color: #aebed8;">{</span>sent: <span style="color: #008b8b;">true</span>, msg: reply<span style="color: #aebed8;">}</span>, <span style="color: #008b8b;">true</span><span style="color: #97b098;">)</span>
    <span style="color: #b0b1a3;">}</span>
    errWrite := t.<span style="color: #00ede1; font-weight: bold;">WriteStatus</span><span style="color: #b0b1a3;">(</span>stream, statusCode, statusDesc<span style="color: #b0b1a3;">)</span>
    <span style="color: #ffad29; font-weight: bold;">if</span> statusCode != codes.OK <span style="color: #b0b1a3;">{</span>
      <span style="color: #ffad29; font-weight: bold;">return</span> <span style="color: #00ede1; font-weight: bold;">Errorf</span><span style="color: #97b098;">(</span>statusCode, statusDesc<span style="color: #97b098;">)</span>
    <span style="color: #b0b1a3;">}</span>
    <span style="color: #ffad29; font-weight: bold;">return</span> errWrite
  <span style="color: #93a8c6;">}</span>
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
<p>
grpc服务端的基本流程就是这样了，我只是看的一个基本流程，再没遇到问题时，基本上不会再看grpc源码了。目前公司项目中在使用grpc，等有了坑，我再来总结吧
</p>
</div>
</div>
