grpc_server.html

<div id="outline-container-org1662978" class="outline-2">
<h2 id="org1662978"><span class="section-number-2">4</span> 总结</h2>
<div class="outline-text-2" id="text-4">
<p>
grpc中有很多我比较喜欢的点，一个是grpcsever的配置通过传递函数来修改，这样又不用取回之前的设置，又可以只修改其中一个值,比较精巧，-0- 原谅我见识不多。还有就是错误的处理，context的使用，trace的使用。
不得不吐槽一下，golang的代码看起来真不够美，虽然简单，但是写起来不够优美，源码的错误处理看起来也是乱糟糟的。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-03-11 Sat 10:00</p>
<p class="validation"></p>
</div>
</body>
</html>
